app/views/recipes/show.html.erb

SELECT  "recipes".* FROM "recipes" WHERE (2) LIMIT ?  [["LIMIT", 1]]
SELECT "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = 17
---
<ul>
	<% @recipe.recipe_ingredients.each do |ri| %>

SELECT "comments".* FROM "comments" WHERE "comments"."recipe_id" = ?  [["recipe_id", 1]]
---
<div class="recipeComments">
	<% @recipe.comments.each do |c| %>