app/views/users/show.html.erb

<ul>
  <% @user.recipes.each do |recipe| %>
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 1]]