app/controllers/comments_controller.rb

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."recipe_id" = ?  [["recipe_id", 1]]
---
  def index
    @comments = Recipe.find(params[:recipe_id]).comments

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "user_id", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "a;lsdkfjas;lfjk"], ["user_id", 1], ["recipe_id", 1], ["created_at", 2017-04-16 14:30:12 UTC], ["updated_at", 2017-04-16 14:30:12 UTC]]
---
  def create
    recipe = Recipe.find(params[:recipe_id])
    @comment = recipe.comments.new(comment_params)
    @comment.user = current_user
    @comment.save