app/controllers/recipes_controller.rb

	def index
		if params[:user_id]
			@recipes = User.find(params[:user_id]).recipes
			@user = User.find(params[:user_id])
		else
			@recipes = Recipe.all
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ? ORDER BY "recipes"."created_at" DESC LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "recipes".* FROM "recipes" ORDER BY "recipes"."created_at" DESC LIMIT ?  [["LIMIT", 1]]

	def create
		user = User.find(params[:user_id])
		@recipe = user.recipes.new(recipe_params)
		if @recipe.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "recipes" ("name", "instructions", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Chicken Parm"], ["instructions", "Cook"], ["user_id", 2], ["created_at", 2017-02-10 03:16:42 UTC], ["updated_at", 2017-02-10 03:16:42 UTC]]

	def show
		@recipe = Recipe.includes(:ingredients, :recipe_ingredients).find(params[:id])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "ingredients".* FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = ?  [["recipe_id", 1]]
SELECT "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = 17